arduino/ArduinoCore-samd/boards.txt
mkrwifi1010.upload.tool=bossac
mkrwifi1010.upload.protocol=sam-ba
mkrwifi1010.upload.maximum_size=262144
mkrwifi1010.upload.use_1200bps_touch=true
mkrwifi1010.upload.wait_for_upload_port=true
mkrwifi1010.upload.native_usb=true
mkrwifi1010.build.mcu=cortex-m0plus
mkrwifi1010.build.f_cpu=48000000L
mkrwifi1010.build.usb_product="Arduino MKR WiFi 1010"
mkrwifi1010.build.usb_manufacturer="Arduino LLC"
mkrwifi1010.build.board=SAMD_MKRWIFI1010
mkrwifi1010.build.core=arduino
mkrwifi1010.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
mkrwifi1010.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrwifi1010.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrwifi1010.build.variant=mkrwifi1010
mkrwifi1010.build.vid=0x2341
mkrwifi1010.build.pid=0x8054
mkrwifi1010.bootloader.tool=openocd
mkrwifi1010.bootloader.file=mkrwifi1010/samd21_sam_ba_arduino_mkrwifi1010.bin

# Arduino NANO 33 IoT
# --------------------
nano_33_iot.name=Arduino NANO 33 IoT
nano_33_iot.vid.0=0x2341
nano_33_iot.pid.0=0x8057
nano_33_iot.vid.1=0x2341
nano_33_iot.pid.1=0x0057

nano_33_iot.upload.tool=bossac
nano_33_iot.upload.protocol=sam-ba
nano_33_iot.upload.maximum_size=262144
nano_33_iot.upload.use_1200bps_touch=true
nano_33_iot.upload.wait_for_upload_port=true
nano_33_iot.upload.native_usb=true
nano_33_iot.build.mcu=cortex-m0plus
nano_33_iot.build.f_cpu=48000000L
nano_33_iot.build.usb_product="Arduino NANO 33 IoT"
nano_33_iot.build.usb_manufacturer="Arduino LLC"
nano_33_iot.build.board=SAMD_NANO_33_IOT
nano_33_iot.build.core=arduino
nano_33_iot.build.extra_flags=-DCRYSTALLESS -D__SAMD21G18A__ {build.usb_flags} {build.tx_rx_swap}
nano_33_iot.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
nano_33_iot.build.openocdscript=openocd_scripts/arduino_zero.cfg
nano_33_iot.build.variant=nano_33_iot
nano_33_iot.build.vid=0x2341
nano_33_iot.build.pid=0x8057
nano_33_iot.bootloader.tool=openocd
nano_33_iot.bootloader.file=nano_33_iot/samd21_sam_ba_arduino_nano_33_iot.bin

menu.r0_tx_rx_bug=TX RX swapped
nano_33_iot.menu.r0_tx_rx_bug.no=No
nano_33_iot.menu.r0_tx_rx_bug.no.build.tx_rx_swap=
nano_33_iot.menu.r0_tx_rx_bug.yes=Yes
nano_33_iot.menu.r0_tx_rx_bug.yes.build.tx_rx_swap=-DTX_RX_NINA_SWAPPED_R0

# Arduino MKR FOX 1200
# --------------------
mkrfox1200.name=Arduino MKR FOX 1200
mkrfox1200.vid.0=0x2341
mkrfox1200.pid.0=0x8050
mkrfox1200.vid.1=0x2341
mkrfox1200.pid.1=0x0050

mkrfox1200.upload.tool=bossac
mkrfox1200.upload.protocol=sam-ba
mkrfox1200.upload.maximum_size=262144
mkrfox1200.upload.use_1200bps_touch=true
mkrfox1200.upload.wait_for_upload_port=true
mkrfox1200.upload.native_usb=true
mkrfox1200.build.mcu=cortex-m0plus
mkrfox1200.build.f_cpu=48000000L
mkrfox1200.build.usb_product="Arduino MKR FOX 1200"
mkrfox1200.build.usb_manufacturer="Arduino LLC"
mkrfox1200.build.board=SAMD_MKRFox1200
mkrfox1200.build.core=arduino
mkrfox1200.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
mkrfox1200.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrfox1200.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrfox1200.build.variant=mkrfox1200
mkrfox1200.build.vid=0x2341
mkrfox1200.build.pid=0x8050
mkrfox1200.bootloader.tool=openocd
mkrfox1200.bootloader.file=mkrfox1200/samd21_sam_ba_arduino_mkrfox1200.bin

# Arduino MKR WAN 1300
# --------------------
mkrwan1300.name=Arduino MKR WAN 1300
mkrwan1300.vid.0=0x2341
mkrwan1300.pid.0=0x8053
mkrwan1300.vid.1=0x2341
mkrwan1300.pid.1=0x0053

mkrwan1300.upload.tool=bossac
mkrwan1300.upload.protocol=sam-ba
mkrwan1300.upload.maximum_size=262144
mkrwan1300.upload.use_1200bps_touch=true
mkrwan1300.upload.wait_for_upload_port=true
mkrwan1300.upload.native_usb=true
mkrwan1300.build.mcu=cortex-m0plus
mkrwan1300.build.f_cpu=48000000L
mkrwan1300.build.usb_product="Arduino MKR WAN 1300"
mkrwan1300.build.usb_manufacturer="Arduino LLC"
mkrwan1300.build.board=SAMD_MKRWAN1300
mkrwan1300.build.core=arduino
mkrwan1300.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
mkrwan1300.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrwan1300.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrwan1300.build.variant=mkrwan1300
mkrwan1300.build.vid=0x2341
mkrwan1300.build.pid=0x8053
mkrwan1300.bootloader.tool=openocd
mkrwan1300.bootloader.file=mkrwan1300/samd21_sam_ba_arduino_mkrwan1300.bin

# Arduino MKR WAN 1310
# --------------------
mkrwan1310.name=Arduino MKR WAN 1310
mkrwan1310.vid.0=0x2341
mkrwan1310.pid.0=0x8059
mkrwan1310.vid.1=0x2341
mkrwan1310.pid.1=0x0059

mkrwan1310.upload.tool=bossac
mkrwan1310.upload.protocol=sam-ba
mkrwan1310.upload.maximum_size=262144
mkrwan1310.upload.use_1200bps_touch=true
mkrwan1310.upload.wait_for_upload_port=true
mkrwan1310.upload.native_usb=true
mkrwan1310.build.mcu=cortex-m0plus
mkrwan1310.build.f_cpu=48000000L
mkrwan1310.build.usb_product="Arduino MKR WAN 1310"
mkrwan1310.build.usb_manufacturer="Arduino LLC"
mkrwan1310.build.board=SAMD_MKRWAN1310
mkrwan1310.build.core=arduino
mkrwan1310.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC -DVERY_LOW_POWER
mkrwan1310.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrwan1310.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrwan1310.build.variant=mkrwan1300
mkrwan1310.build.vid=0x2341
mkrwan1310.build.pid=0x8059
mkrwan1310.bootloader.tool=openocd
mkrwan1310.bootloader.file=mkrwan1300/samd21_sam_ba_arduino_mkrwan1310.bin

# Arduino MKR GSM 1400
# --------------------
mkrgsm1400.name=Arduino MKR GSM 1400
mkrgsm1400.vid.0=0x2341
mkrgsm1400.pid.0=0x8052
mkrgsm1400.vid.1=0x2341
mkrgsm1400.pid.1=0x0052

mkrgsm1400.upload.tool=bossac
mkrgsm1400.upload.protocol=sam-ba
mkrgsm1400.upload.maximum_size=262144
mkrgsm1400.upload.use_1200bps_touch=true
mkrgsm1400.upload.wait_for_upload_port=true
mkrgsm1400.upload.native_usb=true
mkrgsm1400.build.mcu=cortex-m0plus
mkrgsm1400.build.f_cpu=48000000L
mkrgsm1400.build.usb_product="Arduino MKR GSM 1400"
mkrgsm1400.build.usb_manufacturer="Arduino LLC"
mkrgsm1400.build.board=SAMD_MKRGSM1400
mkrgsm1400.build.core=arduino
mkrgsm1400.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
mkrgsm1400.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrgsm1400.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrgsm1400.build.variant=mkrgsm1400
mkrgsm1400.build.vid=0x2341
mkrgsm1400.build.pid=0x8052
mkrgsm1400.bootloader.tool=openocd
mkrgsm1400.bootloader.file=mkrgsm1400/samd21_sam_ba_arduino_mkrgsm1400.bin

# Arduino MKR NB 1500
# --------------------
mkrnb1500.name=Arduino MKR NB 1500
mkrnb1500.vid.0=0x2341
mkrnb1500.pid.0=0x8055
mkrnb1500.vid.1=0x2341
mkrnb1500.pid.1=0x0055

